{ "data" : [


	{"title": "Four Representations of Money in Online Gambling", 
	 "author": "John Rooksby, John Rooksby, Matthew Higgs, Jason Moore, Sylwia Krupa, Claire McCallum",
	 "year" : "2020", 
	 "proc" : "Paper presented at Designing Futures of Money and FinTech, Workshop at DIS ’20, July 7-8, 2020, Eindhoven, Netherlands.",
	 "abstract" : "There is a growing body of work on the design of digital payments systems and virtual currencies, but the design and functionality of gambling technologies has seen little critical attention. In this paper we will draw upon examples from mobile gambling applications to discuss four representations of money/: 'real money', 'winnings', 'deposits', and 'fun'. We will explore how these representations are invoked and tied with regulation, ideas of safety, responsibility, financial value, emotional value, and transactional processes. We will argue that further work should not just focus on the situated practices of gambling, but also the design work seeking to define, enable and constrain gambling practices.",
	 "pdfLink": "http://johnrooksby.org/papers/dis2020_gambling_rooksby.pdf"
	},

	{"title": "Design Opportunities for Digital Men’s Health: An Exploratory Study Focusing on Football Fandom", 
	 "author": "John Rooksby, Marta E. Cecchinato, Parvin Asadzadeh, Matthew Philpott, Christopher Bunn",
	 "year" : "2020", 
	 "proc" : "In Proceedings of DIS ’20, July 6–10, 2020, Eindhoven, Netherlands. DOI: http://dx.doi.org/10.1145/3357236.3395458",
	 "abstract" : "Many men stop exercising as they age, engage in risky behaviours such as alcohol misuse, are reluctant to admit to mental health problems, and avoid seeking help. Men are generally hard to reach for community health interventions. However, interventions run at football clubs have successfully engaged men and have led to positive health outcomes. Mobile health technology might similarly be designed to engage and encourage men via connections with football. This technology could be used to augment and extend community programs, or be used to target global fan bases. However, it is not clear if and how what attracts men to community interventions can translate to technology. In this paper we report a design study with 18 middle-age male participants exploring what men find important in football, and connections between football, health and technology. We present five design opportunities to guide and prompt further innovation in this area.",
	 "publisherLink" : "http://dx.doi.org/10.1145/3357236.3395458",
	 "pdfLink": "http://johnrooksby.org/papers/dis2020_rooksby.pdf"
	},

	{"title": "Trustless education? A blockchain system for University Grades", 
	 "author": "John Rooksby, Kristiyan Dimitrov.",
	 "year" : "2020", 
	 "proc" : "Ubiquity: The Journal of Pervasive Media, Volume 6, Number 1, November 2019, pp. 83-88(6)",
	 "abstract" : "We have implemented a blockchain system based on Ethereum for use by a university to store student grades and to provide a cryptocurrency. Based upon an exploratory, qualitative evaluation we have found several tensions between the concept of a university as an organization and the concept of distributed autonomous organizations (DAOs) in Ethereum. These include tensions in (i) mechanisms of trust, (ii) boundaries of openness and (iii) values in procedures. In this article we outline our implementation and the evaluation process.",
	 "publisherLink" : "https://doi.org/10.1386/ubiq_00010_1"
	},

	{"title": "An N-of-1 Evaluation Framework for Behaviour Change Applications", 
	 "author": "Claire McCallum, John Rooksby, Parvin Asadzaeh, Cindy Gray, Matthew Chalmers.",
	 "year" : "2019", 
	 "proc" : "In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, New York, NY, USA, Paper LBW1810, 6 pages. DOI: https://doi.org/10.1145/3290607.3312923",
	 "abstract" : "Mobile behaviour change applications should be evaluated for their effectiveness in promoting the intended behavior changes. In this paper we argue that the gold standard form of effectiveness evaluation, the randomised controlled trial, has shortcomings when applied to mobile applications. We propose that N-of-1 (also known as single case design) based approaches have advantages. There is currently a lack of guidance for researchers and developers on how to take this approach. We present a framework encompassing three phases and two related checklists for performing N-of-1 evaluations. We also present our analysis of using this framework in the development and deployment of an app that encourages people to walk more. Our key findings are that there are challenges in designing engaging apps that automate N-of-1 procedures, and that there are challenges in collecting sufficient data of good quality. Further research should address these challenges.",
	 "publisherLink" : "https://dl.acm.org/citation.cfm?id=3312923"
	},

	{"title": "Design-for-error for a stand-alone child attachment assessment tool", 
	 "author": "Maki Rooksby, Dong-Bach Vo, John Rooksby, Mohammad Tayarani, Rui Huan, Alessandro Vinciarelli, Helen Minnis, Steve Brewster",
	 "year" : "2019", 
	 "proc" : "In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). ACM, New York, NY, USA, Paper LBW0148, 6 pages. DOI: https://doi.org/10.1145/3290607.3312795",
	 "abstract" : "Designing technology for problem-free operation is vital, but equally important is considering how a user may understand or act upon errors and various other ’stuck’ situations if and when they occur. Little is currently known about what children think and want for overcoming errors. In this paper we report on design-for-error workshops with children (age 5-10) in which we staged 3 simulated errors with a health assessment technology. In our developmentally-sensitive study, children witnessed the errors via a puppet show and created low-fidelity models of recovery mechanisms using familiar ’play-things’. We found the children were able to grasp the representational nature of the task. Their ideas were playful and inspired by magical thinking. Their work forced us to reflect on and revisit our own design assumptions. The tasks have had a direct impact on the design of the assessment tool.",
	 "publisherLink" : "https://dl.acm.org/doi/abs/10.1145/3290607.3312795"
	},

	{"title": "The effect of a programme to improve men's sedentary time and physical activity: The European Fans in Training (EuroFIT) randomised controlled trial.",
	"author": "Wyke, S., Bunn, C., Andersen, E., Silva, M. N., van Nassau, F., McSkimming, P., Kolovos, S., Gill, J., Gray, C. M., Hunt, K., Anderson, A. S., Bosmans, J., Jelsma, J., Kean, S., Lemyre, N., Loudon, D. W., Macaulay, L., Maxwell, D. J., McConnachie, A., Mutrie, N., Nijhuis-van der Sanden, M., Pereira, H. V., Philpott, M., Roberts, G. C., Rooksby, J., Røynesdal, Ø. B., Sattar, N., Sørensen, M., Teixeira, P. J., Treweek, S., van Achterberg, T., van de Glind, I., van Mechelen, W., … van der Ploeg, H. P.",
	"year" : "2019",
	"pdfLink": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6363143/pdf/pmed.1002736.pdf",
	"proc": "PLoS medicine, 16(2), e1002736. doi:10.1371/journal.pmed.1002736",
	"abstract" : "BACKGROUND: Reducing sitting time as well as increasing physical activity in inactive people is beneficial for their health. This paper investigates the effectiveness of the European Fans in Training (EuroFIT) programme to improve physical activity and sedentary time in male football fans, delivered through the professional football setting. METHODS AND FINDINGS: A total of 1,113 men aged 30–65 with self-reported body mass index (BMI) ≥27 kg/m2 took part in a randomised controlled trial in 15 professional football clubs in England, the Netherlands, Norway, and Portugal. Recruitment was between September 19, 2015, and February 2, 2016. Participants consented to study procedures and provided usable activity monitor baseline data. They were randomised, stratified by club, to either the EuroFIT intervention or a 12-month waiting list comparison group. Follow-up measurement was post-programme and 12 months after baseline. EuroFIT is a 12-week, group-based programme delivered by coaches in football club stadia in 12 weekly 90-minute sessions. Weekly sessions aimed to improve physical activity, sedentary time, and diet and maintain changes long term. A pocket-worn device (SitFIT) allowed self-monitoring of sedentary time and daily steps, and a game-based app (MatchFIT) encouraged between-session social support. Primary outcome (objectively measured sedentary time and physical activity) measurements were obtained for 83% and 85% of intervention and comparison participants. Intention-to-treat analyses showed a baseline-adjusted mean difference in sedentary time at 12 months of −1.6 minutes/day (97.5% confidence interval [CI], −14.3–11.0; p = 0.77) and in step counts of 678 steps/day (97.5% CI, 309–1.048; p < 0.001) in favor of the intervention. There were significant improvements in diet, weight, well-being, self-esteem, vitality, and biomarkers of cardiometabolic health in favor of the intervention group, but not in quality of life. There was a 0.95 probability of EuroFIT being cost-effective compared with the comparison group if society is willing to pay £1.50 per extra step/day, a maximum probability of 0.61 if society is willing to pay £1,800 per minute less sedentary time/day, and 0.13 probability if society is willing to pay £30,000 per quality-adjusted life-year (QALY). It was not possible to blind participants to group allocation. Men attracted to the programme already had quite high levels of physical activity at baseline (8,372 steps/day), which may have limited room for improvement. Although participants came from across the socioeconomic spectrum, a majority were well educated and in paid work. There was an increase in recent injuries and in upper and lower joint pain scores post-programme. In addition, although the five-level EuroQoL questionnaire (EQ-5D-5L) is now the preferred measure for cost-effectiveness analyses across Europe, baseline scores were high (0.93), suggesting a ceiling effect for QALYs. CONCLUSION: Participation in EuroFIT led to improvements in physical activity, diet, body weight, and biomarkers of cardiometabolic health, but not in sedentary time at 12 months. Within-trial analysis suggests it is not cost-effective in the short term for QALYs due to a ceiling effect in quality of life. Nevertheless, decision-makers may consider the incremental cost for increase in steps worth the investment. TRIAL REGISTRATION: International Standard Randomised Controlled Trials, ISRCTN-81935608.",
	"publisherLink" : "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6363143/"
	},

	{"title": "Student Perspectives on Digital Phenotyping: The Acceptability of Using Smartphone Data to Assess Mental Health", 
	 "author": "John Rooksby, Alistair Morrison, and Dave Murray-Rust.",
	 "year" : "2019", 
	 "pdfLink" : "http://johnrooksby.org/papers/CHI2019_rooksby_phenotyping.pdf", 
	 "proc" : "In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, New York, NY, USA, Paper 425, 14 pages. DOI: https://doi.org/10.1145/3290605.3300655",
	 "abstract" : "There is a mental health crisis facing universities internationally. A growing body of interdisciplinary research has successfully demonstrated that using sensor and interaction data from students’ smartphones can give insight into stress, depression, mood, suicide risk and more. The approach, which is sometimes termed Digital Phenotyping, has potential to transform how mental health and wellbeing can be monitored and understood. The approach could also transform how interventions are designed, delivered and evaluated. To date, little work has addressed the human and ethical side of digital phenotyping, including how students feel about being monitored. In this paper we report findings from in-depth focus groups, prototyping and interviews with students. We find they are positive about mental health technology, but also that there are multi-layered issues to address if digital phenotyping is to become acceptable. Using an acceptability framework, we set out the key design challenges that need to be addressed.",
	 "publisherLink" : "https://dl.acm.org/citation.cfm?id=3300655"
	},

	{"title": "Evaluating the Impact of Physical Activity Apps and Wearables: Interdisciplinary Review", 
	 "author": "Claire McCallum, John Rooksby, Cindy Gray.",
	 "year" : "2018", 
	 "pdfLink" : "https://mhealth.jmir.org/2018/3/e58/", 
	 "proc" : "JMIR Mhealth Uhealth 2018;6(3):e58",
	 "abstract" : "Background: Although many smartphone apps and wearables have been designed to improve physical activity, their rapidly evolving nature and complexity present challenges for evaluating their impact. Traditional methodologies, such as randomized controlled trials (RCTs), can be slow. To keep pace with rapid technological development, evaluations of mobile health technologies must be efficient. Rapid alternative research designs have been proposed, and efficient in-app data collection methods, including in-device sensors and device-generated logs, are available. Along with effectiveness, it is important to measure engagement (ie, users’ interaction and usage behavior) and acceptability (ie, users’ subjective perceptions and experiences) to help explain how and why apps and wearables work. Objectives: This study aimed to (1) explore the extent to which evaluations of physical activity apps and wearables: employ rapid research designs; assess engagement, acceptability, as well as effectiveness; use efficient data collection methods; and (2) describe which dimensions of engagement and acceptability are assessed. Method: An interdisciplinary scoping review using 8 databases from health and computing sciences. Included studies measured physical activity, and evaluated physical activity apps or wearables that provided sensor-based feedback. Results were analyzed using descriptive numerical summaries, chi-square testing, and qualitative thematic analysis. Results: A total of 1829 abstracts were screened, and 858 articles read in full. Of 111 included studies, 61 (55.0%) were published between 2015 and 2017. Most (55.0%, 61/111) were RCTs, and only 2 studies (1.8%) used rapid research designs: 1 single-case design and 1 multiphase optimization strategy. Other research designs included 23 (22.5%) repeated measures designs, 11 (9.9%) nonrandomized group designs, 10 (9.0%) case studies, and 4 (3.6%) observational studies. Less than one-third of the studies (32.0%, 35/111) investigated effectiveness, engagement, and acceptability together. To measure physical activity, most studies (90.1%, 101/111) employed sensors (either in-device [67.6%, 75/111] or external [23.4%, 26/111]). RCTs were more likely to employ external sensors (accelerometers: P=.005). Studies that assessed engagement (52.3%, 58/111) mostly used device-generated logs (91%, 53/58) to measure the frequency, depth, and length of engagement. Studies that assessed acceptability (57.7%, 64/111) most often used questionnaires (64%, 42/64) and/or qualitative methods (53%, 34/64) to explore appreciation, perceived effectiveness and usefulness, satisfaction, intention to continue use, and social acceptability. Some studies (14.4%, 16/111) assessed dimensions more closely related to usability (ie, burden of sensor wear and use, interface complexity, and perceived technical performance). Conclusions: The rapid increase of research into the impact of physical activity apps and wearables means that evaluation guidelines are urgently needed to promote efficiency through the use of rapid research designs, in-device sensors and user-logs to assess effectiveness, engagement, and acceptability. Screening articles was time-consuming because reporting across health and computing sciences lacked standardization. Reporting guidelines are therefore needed to facilitate the synthesis of evidence across disciplines.",
	 "publisherLink" : "https://mhealth.jmir.org/2018/3/e58/"
	},

	{"title": "Synchronous Text Messaging: A Field Trial of Curtains Messenger.", 
	 "author": "Martin Podlubny, John Rooksby, Mattias Rost, and Matthew Chalmers.",
	 "year" : "2017", 
	 "pdfLink" : "http://johnrooksby.org/papers/PACMHCI-2018-rooksby.pdf", 
	 "proc" : "Proc. ACM Hum.-Comput. Interact. 1, 2, Article 86 (November 2017), 20 pages. https://doi.org/10.1145/3134721",
	 "abstract" : "We have created and evaluated a novel mobile messaging app named Curtains Messenger. The app has been designed to support synchrony in messaging. It does this by requiring users to be in the app at the same time as each other in order to send, receive and read messages. This design is contrary to typical apps where messages can be sent and read asynchronously at an individual’s convenience. We have conducted a  eld trial in which 15 users installed the app on their own devices and used it in the wild. We present a qualitative analysis of interviews with the participants following the trial. The  ndings address how the app was used, how synchrony a ected conversational  ows, how synchrony raised issues of attention and intimacy, and what issues users faced in the practical work of conducting synchronous messaging. This work demonstrates how core concepts in the study of cooperative work such as a/synchrony can be drawn upon to reconsider taken-for-granted design features of mobile applications and the lived experience of communication.",
	 "publisherLink" : "https://dl.acm.org/citation.cfm?doid=3171581.3134721"
	},

	{"title": "The intervention process in the European Fans in Training (EuroFIT) trial: a mixed method protocol for evaluation", 
	 "author": "van de Glind, I., Bunn, C., Gray, C.M., Hunt, K., Andersen, E., Jelsma, J., Morgan, H., Pereira, H., Roberts, G., Rooksby, J., Røynesdal, Ø., Silva, M., Sørensen, M., Treweek, S., van Achterberg, T., van der Ploeg, H., van Nassau, F., Nijhuis-van der Sanden, M., and Wyke, S.",
	 "year" : "2017", 
	 "pdfLink" : "http://eprints.gla.ac.uk/144159/7/144159.pdf", 
	 "proc" : "Trials, 18, 356. (doi:10.1186/s13063-017-2095-0)",
	 "abstract" : "Background: EuroFIT is a gender-sensitised, health and lifestyle program targeting physical activity, sedentary time and dietary behaviours in men. The delivery of the program in football clubs, led by the clubs' community coaches, is designed to both attract and engage men in lifestyle change through an interest in football or loyalty to the club they support. The EuroFIT program will be evaluated in a multi-centre pragmatic randomised controlled trial (RCT), for which ~1,000 overweight men, aged 30 to 65 years, will be recruited in 15 top professional football clubs in the Netherlands, Norway, Portugal and UK. The process evaluation is designed to investigate how implementation within the RCT is achieved in the various football clubs and countries, and the processes through which EuroFIT affects outcomes. Methods: This mixed methods evaluation is guided by the MRC guidance for conducting process evaluations of complex interventions. Data will be collected in the intervention arm of the EuroFIT trial through: participant questionnaires (n=500), attendance sheets and coach logs (n=360), observations of sessions (n=30), coach questionnaires (n=30), usage logs from a novel device for self-monitoring physical activity and non-sedentary behaviour (SitFIT), an app-based game to promote social support for physical activity outside program sessions (MatchFIT), interviews with coaches (n=15), football club representatives (n=15), and focus groups with participants (n=30). Written standard operating procedures are used to ensure quality and consistency in data collection and analysis across the participating countries. Data will be analysed thematically within data sets and overall synthesis of findings will address the processes through which the program is implemented in various countries and clubs and through which it affects outcomes, with careful attention to the context of the football club. Discussion: The process evaluation will provide a comprehensive account of what was necessary to implement the EuroFIT program in professional football clubs within a trial setting, and how outcomes were affected by the program. This will allow us to re-appraise the program's conceptual base, optimise the program for post-trial implementation and roll out, and offer suggestions for the development and implementation of future initiatives to promote health and wellbeing through professional sports clubs.",
	 "publisherLink" : "https://trialsjournal.biomedcentral.com/articles/10.1186/s13063-017-2095-0"
	},

	{"title": "Quantified data and social relationships", 
	 "author": "Chris Elsden, Paul Marshall, Aisling O’Kane, Abigail C. Durrant, Rowanne Fleck, John Rooksby, Deborah Lupton.",
	 "year" : "2017", 
	 "pdfLink" : "http://johnrooksby.org/papers/CHI2017_elsden.pdf", 
	 "proc" : "Quantified Data & Social Relationships. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 644-651. DOI: https://doi.org/10.1145/3027063.3027065",
	 "abstract" : "This one-day workshop will encourage the emergence of more critical and socially oriented perspectives to a data-driven life. We adopt a focus on how data mediates relationships – personal, professional, across social networks and cross-culturally – to consider the social and cultural implications of quantified lifestyles. At the workshop, attendees will engage in panel discussions, and a series of ‘speed-dates’ to develop a catalogue of compelling relationships with data, which exemplify the social nature of personal informatics tools, and the opportunities and challenges for design.",
	 "publisherLink" : "http://dl.acm.org/citation.cfm?id=3027065&CFID=651578370&CFTOKEN=75023293"
	},

	{"title": "Trustless Education? A Blockchain System for University Grades.", 
	 "author": "John Rooksby, Kristiyan Dimitrov",
	 "year" : "2017", 
	 "pdfLink" : "http://johnrooksby.org/papers/DAOworkshop_rooksby.pdf", 
	 "proc" : "Paper presented at New Value Transactions Understanding and Designing for Distributed Autonomous Organisations. Workshop at DIS 2017, 10th June, Edinburgh.",
	 "abstract" : "We have implemented a blockchain system based on Ethereum for use by a university to store student grades and to provide a cryptocurrency. Based upon an exploratory, qualitative evaluation we have found several tensions between the concept of a university as an organisation, and the concept of distributed autonomous organisations (DAOs) in Ethereum. These include tensions in (i) mechanisms of trust, (ii) boundaries of openness, (iii) values in procedures. In this paper we outline our implementation and the evaluation process."
	},

	{"title": "Technology for Self-Management of Rosacea: A Survey and Field Trial.", 
	 "author": "Davis Buls, John Rooksby",
	 "year" : "2017", 
	 "pdfLink" : "http://johnrooksby.org/papers/CHI2017_Buls_rosacea.pdf", 
	 "proc" : "Technology for Self-Management of Rosacea: A Survey and Field Trial. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 1516-1523. DOI: https://doi.org/10.1145/3027063.3053080",
	 "abstract" : "Rosacea is a chronic skin condition with multiple signs and symptoms, but typically associated with reddening of the face. Sufferers usually want to avoid and reduce flare-ups of the condition, and so will try to identify and limit possible triggers. In this paper we report an investigation into technology for managing rosacea, particularly for identifying and tracking triggers. Our study has included: a survey of the existing technology; a survey of the attitudes and opinions of people with rosacea on technology; and finally, the production and evaluation of a prototype for identifying triggers. This work is investigatory and so our formative evaluation and discussion focus on understanding the problem space and establishing directions for future development work.",
	 "publisherLink" : "http://dl.acm.org/citation.cfm?id=3053080"
	},

	{"title": "Personal Tracking and Everyday Relationships: Reflections on Three Prior Studies.", 
	 "author": "John Rooksby",
	 "year" : "2017", 
	 "pdfLink" : "http://johnrooksby.org/papers/CHI2017_qr_workshop_paper.pdf", 
	 "proc" : "Paper presented at Quantified Data and Social Relationships workshop at CHI 2017, Denver, May 2017.",
		 "abstract" : "This paper summarizes and discusses findings about personal tracking and social relationships from three studies. All three studies were interview based, one where people were interviewed about their general use of trackers and two where they were interviewed about novel prototypes. None of the studies were specifically about social relationships. Yet, the details of people’s everyday relationships pervaded the findings about what, how and why tracking is done. In this paper I put forward the notion that tracking is enmeshed in relationships: that the ways in which tracking is done is contingent on people’s everyday social relationships. This can be true irrespectively of what social features a tracker has or what the user is trying to achieve with the tracker."
		},


	{"title": "Some Design Challenges for Self Experimentation Apps.", 
	 "author": "John Rooksby, Claire McCallum, Parvin Asadzadeh, Davis Buls, Matthew Chalmers",
	 "year" : "2017", 
	 "pdfLink" : "http://johnrooksby.org/papers/CHI2017_se_workshop_paper.pdf", 
	 "proc" : "Paper presented at Digital Health and Self Experimentation Workshop at CHI 2017. Denver, May 2017.",
	 "abstract" : "In this paper we outline several design challenges relevant to the creation of self-experimentation apps: (1) operationalization of experimental design, (2) data collection, (3) fostering appropriate engagement, (4) weak relationships with users, (5) ethical and privacy issues. These challenges are based on experiences in the creation and evaluation of apps for self-monitoring and behaviour change."
		},

	{"title": "Physical Activity App Store Apps: How Can We Evaluate their Effectiveness?", 
	 "author": "Claire McCallum, Parvin Asadzadeh, John Rooksby, Matthew Chalmers and Cindy Gray",
	 "year" : "2017", 
	 "proc" : "Front. Public Health. Conference Abstract: 3rd UCL Centre for Behaviour Change Digital Health Conference 2017: Harnessing digital technology for behaviour change. doi: 10.3389/conf.FPUBH.2017.03.00059",
	 "abstract" : "Rationale: Thousands of smartphone physical activity applications (apps) are readily available through app stores. However, the rapidly evolving nature of apps presents challenges for evaluating their effectiveness. Traditional methodologies, such as randomised control trials, are slow and often impractical. Alternative methodologies that can accommodate rapid evaluation of smartphone apps are required. App store platforms can be used to automate evaluation procedures, and potentially reach many users. Single Case Designs (SCDs) may be a compatible approach to evaluate the effectiveness of app store apps. However, SCDs involve rigorous methodological criteria, and the feasibility of implementing these in an app store environment has not yet been tested. Aim: To explore whether SCD criteria can be implemented in an app store release of a smartphone app-based intervention (Quped), designed to promote physical activity through self-monitoring, goal setting and social comparison. Methods:  A mixed methods approach, including review and synthesis of SCD methodological criteria from established checklists to inform the design of the Quped app.  Following deployment on the Apple App Store in February 2016, six months of smartphone-logged data was collected from users (aged≥18 years downloading Quped on an iPhone 5S or above), and 13 semi-structured interviews conducted. Analysis:  Descriptive analyses (frequencies and visualisations) of logged data and framework analysis of interview transcripts.Results: Five methodological criteria were identified as essential to the application of SCDs in evaluating the effectiveness of app store apps: (i) repeated measurement of the outcome over time; (ii) at least three outcome measurements in both baseline and intervention phases; (iii) the intervention introduced at different time points to provide overlap between baseline and intervention phases across users; (iv) replication across users with different characteristics; and (v) users’ perspectives on social acceptability (e.g. data privacy). These criteria were implemented during the deployment of Quped as follows: step counts (the outcome) were retrieved daily from internal smartphone sensors; retrieving steps retrospectively from the week prior to download provided baseline data; intervention timing was manipulated by delaying the introduction of goal-setting. 145 users downloaded Quped and consented to the study, and 80 (55.2%) were eligible for inclusion. 55/80 (68.8%) provided repeated measurement of steps during both baseline and intervention phases, but ≥3 data points per phase were only available for 43/80 (53.8%). Visualizations of download patterns revealed overlap between different users’ baseline and intervention phases. 62 (77.5%) users provided information on their age and gender through the app’s social comparison feature.  Interviews suggested that participants were happy to provide their personal step count data to the research team, but were surprised that it could be accessed retrospectively. Conclusion: The largely successful implementation of SCD methodological criteria in the design and deployment of Quped demonstrates that SCDs are a feasible approach for evaluating the effectiveness of app store PA apps. However, length of use and missing data may limit sample size considerably, and more work is needed to ensure users are fully informed of how (and when) their personal data will be collected.",
	 "publisherLink" : "http://www.frontiersin.org/10.3389/conf.FPUBH.2017.03.00059/4089/3rd_UCL_Centre_for_Behaviour_Change_Digital_Health_Conference_2017_Harnessing_digital_technology_fo/all_events/event_abstract"
	},

	{"title": "Implementing Ethics for a Mobile App Deployment", 
	 "author": "John Rooksby, Parvin Asadzadeh, Alistair Morrison, Claire McCallum, Cindy Gray, Matthew Chalmers",
	 "year" : "2016", 
	 "pdfLink" : "http://johnrooksby.org/papers/OzCHI16-rooksby-implementingEthics.pdf", 
	 "publisherLink" : "http://dl.acm.org/citation.cfm?id=3010919&dl=ACM&coll=DL&CFID=651578370&CFTOKEN=75023293",
	 "proc" : "In Proceedings of the 28th Australian Conference on Computer-Human Interaction (OzCHI '16). ACM, New York, NY, USA, 406-415. DOI: https://doi.org/10.1145/3010915.3010919",
	 "abstract" : "This paper discusses the ethical dimensions of a research project in which we deployed a personal tracking app on the Apple App Store and collected data from users with whom we had little or no direct contact. We describe the in-app functionality we created for supporting consent and withdrawal, our approach to privacy, our navigation of a formal ethical review, and navigation of the Apple approval process. We highlight two key issues for deployment-based research. Firstly, that it involves addressing multiple, sometimes conflicting ethical principles and guidelines. Secondly, that research ethics are not readily separable from design, but the two are enmeshed. As such, we argue that in-action and situational perspectives on research ethics are relevant to deployment-based research, even where the technology is relatively mundane. We also argue that it is desirable to produce and share relevant design knowledge and embed in-action and situational approaches in design activities. "
	},

	{"title": "Study protocol of European Fans in Training (EuroFIT): a four-country randomised controlled trial of a lifestyle program for men delivered in elite football clubs", 
	 "author": "Femke van Nassau, Hidde P. van der Ploeg, Frank Abrahamsen, Eivind Andersen, Annie S. Anderson, Judith E. Bosmans, Christopher Bunn, Matthew Chalmers, Ciaran Clissmann, Jason M. R. Gill, Cindy M. Gray, Kate Hunt, Judith G.M. Jelsma, Jennifer G. La Guardia, Pierre N. Lemyre, David W. Loudon, Lisa Macaulay, Douglas J. Maxwell, Alex McConnachie, Anne Martin, Nikos Mourselas, Nanette Mutrie, Ria Nijhuis-van der Sanden, Kylie O’Brien, Hugo V. Pereira, Matthew Philpott, Glyn C. Roberts, <b>John Rooksby</b>, Mattias Rost, Øystein Røynesdal, Naveed Sattar, Marlene N. Silva, Marit Sorensen, Pedro J. Teixeira, Shaun Treweek, Theo van Achterberg, Irene van de Glind, Willem van Mechelen and Sally Wyke",
	 "year" : "2016", 
	 "pdfLink" : "http://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-016-3255-y",
	 "publisherLink" : "http://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-016-3255-y", 
	 "proc" : "BMC Public Health 2016 16:598. DOI: 10.1186/s12889-016-3255-y",
		 "abstract" : "Background Lifestyle interventions targeting physical activity, sedentary time and dietary behaviours have the potential to initiate and support behavioural change and result in public health gain. Although men have often been reluctant to engage in such lifestyle programs, many are at high risk of several chronic conditions. We have developed an evidence and theory-based, gender sensitised, health and lifestyle program (European Fans in Training (EuroFIT)), which is designed to attract men through the loyalty they feel to the football club they support. This paper describes the study protocol to evaluate the effectiveness and cost-effectiveness of the EuroFIT program in supporting men to improve their level of physical activity and reduce sedentary behaviour over 12 months. Methods The EuroFIT study is a pragmatic, two-arm, randomised controlled trial conducted in 15 football clubs in the Netherlands, Norway, Portugal and the UK (England). One-thousand men, aged 30 to 65 years, with a self-reported Body Mass Index (BMI) ≥27 kg/m2 will be recruited and individually randomised. The primary outcomes are objectively-assessed changes in total physical activity (steps per day) and total sedentary time (minutes per day) at 12 months after baseline assessment. Secondary outcomes are weight, BMI, waist circumference, resting systolic and diastolic blood pressure, cardio-metabolic blood biomarkers, food intake, self-reported physical activity and sedentary time, wellbeing, self-esteem, vitality and quality of life. Cost-effectiveness will be assessed and a process evaluation conducted. The EuroFIT program will be delivered over 12 weekly, 90-minute sessions that combine classroom discussion with graded physical activity in the setting of the football club. Classroom sessions provide participants with a toolbox of behaviour change techniques to initiate and sustain long-term lifestyle changes. The coaches will receive two days of training to enable them to create a positive social environment that supports men in engaging in sustained behaviour change. Discussion The EuroFIT trial will provide evidence on the effectiveness and cost-effectiveness of the EuroFIT program delivered by football clubs to their male fans, and will offer insight into factors associated with success in making sustained changes to physical activity, sedentary behaviour, and secondary outcomes, such as diet. "
		},
		
	{"title": "Deployment of an App for Self Monitoring and Social Support within a Health Promotion Programme.", 
	 "author": "John Rooksby, Mattias Rost, Doudou Tang, Matthew Chalmers ",
	 "year" : "2016", 
	 "proc" : "Paper presented at Workshop on Interactive Systems in Healthcare (WISH), May 7th 2016, San Jose, CA.",
		 "abstract" : "This paper describes work-in-progress on the deployment of MatchFIT, an app for enabling self- monitoring and on-going social support for people that have participated in a healthy living programme called EuroFIT. The app is currently in use by approximately 250 people in 15 locations across three countries. It will be launched in a fourth country shortly and based upon the lessons learned will be redesigned for a second round of the EuroFIT programme in late 2016. This paper discusses the design challenges we have encountered and issues in redesign.",
		 "pdfLink" : "http://johnrooksby.org/papers/WISH2016_rooksby.pdf"

		},

		{"title": "Investigating how users engage with a pedometer app", 
	 "author": "Parvin Asadzadeh, John Rooksby, Matthew Chalmers ",
	 "year" : "2016", 
	 "pdfLink" : "http://johnrooksby.org/papers/UBIMI16-asadzadeh.pdf", 
	 "publisherLink" : "http://dl.acm.org/citation.cfm?id=2971589",
	 "proc" : "UbiComp '16, Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct. Pages 612-617. doi:10.1145/2968219.2971589",
		 "abstract" : "Mobile application usage data has been investigated by many researchers to explore reasoning about users’ contexts and their routines. A large number of early studies in this area provide relatively simple analyses, and some more recent works look more deeply at the patterns of logged events. This paper explains a new work on the analysis of interaction logs collected from a pedometer-based mobile app to extract different usage patterns of the app "
		},

		{"title": "Personal Tracking of Screen Time on Digital Devices", 
	 "author": "Rooksby J, Asadzadeh P, Rost M, Morrison A, and Chalmers M.",
	 "year" : "2016", 
	 "pdfLink" : "http://johnrooksby.org/papers/CHI2016_Rooksby_Screenlife.pdf", 
	 "publisherLink" : "http://dl.acm.org/citation.cfm?id=2858055&CFID=651578370&CFTOKEN=75023293",
	 "proc" : "Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, Pages 284-296. doi: 10.1145/2858036.2858055",
		 "abstract" : "Numerous studies have tracked people’s everyday use of digital devices, but without consideration of how such data might be of personal interest to the user. We have developed a personal tracking application that enables users to automatically monitor their ‘screen time’ on mobile devices (iOS and Android) and computers (Mac and Windows). The application interface enables users to combine screen time data from multiple devices. We trialled the application for 28+ days with 21 users, collecting log data and interviewing each user. We found that there is interest in personal tracking in this area, but that the study participants were less interested in quantifying their overall screen time than in gaining data about their use of specific devices and applications. We found that personal tracking of device use is desirable for goals including: increasing productivity, disciplining device use, and cutting down on use. "
		},
		
		{"title": "Evaluation Methods for Physical Activity-Promoting Technologies", 
	 "author": "McCallum C, Gray C, Rooksby J",
	 "year" : "2016", 
	 "pdfLink" : "http://johnrooksby.org/papers/mccallum_scopingreview_poster.pdf", 
	 "proc" : "Poster presented at the 2nd Behaviour Change Conference: Digital Health and Wellbeing. 24-25 Feb 2016, London, UK.",
		 "abstract" : "Poster"
		},
		

		{"title": "Mobile Wellbeing. ", 
	 "author": "Mattias Rost, John Rooksby, Alexandra Weilenmann, Thomas Hillman, Pål Dobrin, Juan Ye.",
	 "year" : "2016", 
	 "pdfLink" : "", 
	 "proc" : "In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI '16). ACM, New York, NY, USA, Article 137, 3 pages. DOI: https://doi.org/10.1145/2971485.2987676",
		 "abstract" : "While mobile phones can be empowering, constant access to a world of people and information can also bring distraction from the present moment and from the people and things that are physically present in ways that are sometimes unwanted. Excessive use of mobile phones can also have negative consequences on our sleep and concentration. In many respects mobile phones are challenging for our general mental wellbeing. Many designers are now looking into ways to better support mental wellbeing, be it through apps for mindfulness and meditation, or the better design of notifications and sleep modes. People are also developing strategies and ways of coping with the negative aspects of mobile technology, from self-control based approaches such as uninstalling social media apps or not keeping phones by the bedside, to more practice-based approaches such as meditation. This workshop aims to bring researchers and practitioners together to discuss mobile technology, human practice and mental wellbeing.",
		 "publisherLink" : "http://dl.acm.org/citation.cfm?id=2987676&CFID=651578370&CFTOKEN=75023293"
		},

		{"title": "Configuring Attention in the Multiscreen Living Room", 
	 "author": "Rooksby J, Smith T, Morrison A, Rost M and Chalmers M.",
	 "year" : "2015", 
	 "pdfLink" : "", 
	 "proc" : "In: ECSCW 2015: 14th European Conference on Computer Supported Cooperative Work, Oslo, Norway, 19-23 Sept 2015, pp. 243-261. doi:10.1007/978-3-319-20499-4_13.",
		 "abstract" : ""
		},

		{"title": "FITtogether: An ‘Average’ Activity Tracker", 
	 "author": "Rost M, Rooksby J, and McCallum C.",
	 "year" : "2015", 
	 "pdfLink" : "http://johnrooksby.org/papers/CHI2015_FITtogether.pdf", 
	 "proc" : "Beyond Personal Informatics: Designing for Experiences of Data (Workshop at CHI 2015), April 18th 2015, Seoul.",
		 "abstract" : "In this paper we discuss an app we have implemented for iOS and Android called FITtogether. The app counts users’ steps and enables them to compare these with the average steps of all other users. We have trialed the app over a two week period in the wild on users’ own devices. Our findings suggest that comparison with an average leads to users feeling that they are successful if they are above average, and that by making a personal step count available to others only as part of an average does not lead to anonymity and identity concerns. "
		},

		{"title": "MyCity: Glasgow – how can a mobile app based game increase physical activity in the context of a mass spectator sporting event?", 
	 "author": "Gray C, Higgs M, Ramsay A, Rooksby J, Lennon M ",
	 "year" : "2015", 
	 "pdfLink" : "", 
	 "proc" : "Paper presented at ISBNPA International Society of Behavioural Nutrition and Physical Activity, 3rd-6th June, Edinburgh.",
		 "abstract" : ""
		},


		{"title": "Pass the Ball: Enforced Turn Taking in Activity Tracking", 
	 "author": "Rooksby J, Rost M, Morrison A, Chalmers M ",
	 "year" : "2015", 
	 "pdfLink" : "http://johnrooksby.org/papers/CHI2015_Rooksby_PassTheBall.pdf", 
	 "publisherLink" : "http://dl.acm.org/citation.cfm?id=2702577&CFID=651578370&CFTOKEN=75023293",
	 "proc" : "In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2417-2426. doi:10.1145/2702123.2702577",
		 "abstract" : "We have developed a mobile application called Pass The Ball that enables users to track, reflect on, and discuss physical activity with others. We followed an iterative design process, trialling a first version of the app with 20 people and a second version with 31. The trials were conducted in the wild, on users’ own devices. The second version of the app enforced a turn-taking system that meant only one member of a group of users could track their activity at any one time. This constrained tracking at the individual level, but more successfully led users to communicate and interact with each other. We discuss the second trial with reference to two concepts: social relatedness and individual-competence. We discuss six key lessons from the trial, and identify two high-level design implications: attend to “practices” of tracking; and look within and beyond “collaboration” and “competition” in the design of activity trackers. "
		},


		{"title": "Logging Consumer Applications in mHealth: Experiences and Opportunities", 
	 "author": "Gray C, Lennon M, Morrison A, Ramsay A, Rooksby J, Rost M ",
	 "year" : "2014", 
	 "pdfLink" : "http://johnrooksby.org/papers/DE2014_rooksby.pdf", 
	 "proc" : "Presented at DE2014 The Fifth Annual Digital Economy All Hands Meeting, Imperial College London, December 3-5, 2014.",
		 "abstract" : "This paper addresses the collection of data from consumer mHealth applications (mobile health apps). We use two consumer mHealth apps as examples, both of which we have developed and released. The apps are both designed to encourage and support walking: the first by way of a Commonwealth Games theme; and the second by way of a football themed competition. We discuss what data we collected from these apps, broadly categorizing it in terms of user statistics, game-relevant data, usage data and processed data. We also outline the ethical issues in collecting such data. We give two reasons for collecting data: to understand activity and to inform design. We then argue that a grand challenge in public health is to collect data across various apps in order to understand and support the mHealth “ecosystem”, i.e. the mass of apps that people have access to and can choose between. "
		},
		
		{"title": "The Theory and Practice of Randori Coding Dojos.", 
	 "author": "Rooksby J, Hunt J, Wang X",
	 "year" : "2014", 
	 "pdfLink" : "http://johnrooksby.org/papers/XP2014_rooksby_dojo.pdf", 
	 "proc" : "In: Agile Processes in Software Engineering and Extreme Programming: 15th International Conference (XP2014), Rome, Italy, May 26-30, 2014: 251-259.",
		 "abstract" : "The coding dojo is a technique for continuous learning and training. Randori is one implementation format. Even though experience and lessons learnt on how coding dojos could be better organized have been reported in agile literature, the theoretical bases behind it have never been investigated. In this paper we propose to use reflective practice as a sense-making device to underpin the investigation and improvement of coding dojo for effective learning. Based on the examination of two dojo sessions we argue that the insights from the reflective practice and related theories can open new and interesting inquiries on coding dojo, and eventually help to better understand the dynamics of coding dojo, and improve the dojo practice accordingly. "
		},

		{"title": "Personal Tracking as Lived Informatics.", 
	 "author": "Rooksby J, Rost M, Morrison A, Chalmers M ",
	 "year" : "2014", 
	 "pdfLink" : "http://johnrooksby.org/papers/livedinformatics.pdf",
	 "publisherLink" : "In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, New York, NY, USA, 1163-1172. DOI=10.1145/2556288.2557039 http://doi.acm.org/10.1145/2556288.2557039", 
	 "proc" : "In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2014): 1163-1172 ",
		 "abstract" : "This paper characterises the use of activity trackers as ‘lived informatics’. This characterisation is contrasted with other discussions of personal informatics and the quantified self. The paper reports an interview study with activity tracker users. The study found: people do not logically organise, but interweave various activity trackers, sometimes with ostensibly the same functionality; that tracking is often social and collaborative rather than personal; that there are different styles of tracking, including goal driven tracking and documentary tracking; and that tracking information is often used and interpreted with reference to daily or short term goals and decision making. We suggest there will be difficulties in personal informatics if we ignore the way that personal tracking is enmeshed with everyday life and people’s outlook on their future. "
		},

		{"title": "Can Plans and Situated Actions Be Replicated?", 
	 "author": "Rooksby J",
	 "year" : "2014", 
	 "pdfLink" : "http://johnrooksby.org/papers/CSCW2014_rooksby_replicated.pdf", 
	 "proc" : "In: Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW 2014). 603-614.",
		 "abstract" : "This paper discusses a repetition of a study presented in Suchman’s book Plans and Situated Actions. There have been complaints about the lack of replication studies in disciplines related to CSCW (particularly Software Engineering and HCI). However, these complaints often become embedded in wider attempts to install a principled scientific method within these disciplines. Plans and Situated Actions was not a scientific text but drew upon naturalistic analysis. This paper shows there is value in recreating Plans and Situated Actions, and argues it would be helpful to recreate other studies. However, such repetition does not and need not constitute a scientific replication. The paper argues that while repetition and reanalysis may improve rigour in computing research, this need not be with a view to making it more scientific. "
		},

		{"title": "Practices of Parallel Media: Using Mobile Devices When Watching Television", 
	 "author": "Rooksby J",
	 "year" : "2014", 
	 "pdfLink" : "http://johnrooksby.org/papers/DomesticWorkshop2013_rooksby.pdf", 
	 "proc" : "Designing with Users for Domestic Environments (Workshop at CSCW 2014), Feb 15th 2014, Baltimore.",
		 "abstract" : "We have been studying how people use mobile phones and laptops while watching television. Our results show that these are not necessarily used to access content that is related to what is being watched. However, this is not to say devices are being used in isolation from their surrounds; their use is interwoven with watching television and with interacting with other people. We suggest that designing for ‘the connected home’ is more than an integration project, and should take account of the social fabric of domestic life. "
		},

		{"title": "Interview and Observation for Mobile App Development.", 
	 "author": "Rooksby J",
	 "year" : "2013", 
	 "pdfLink" : "http://johnrooksby.org/papers/largeWorkshop2013_rooksby.pdf", 
	 "proc" : "Informing Future Design via Large-Scale Research Methods and Big Data (Workshop at Mobile HCI 2013), August 27th 2013, Munich.",
		 "abstract" : "This position paper discusses how user feedback, particularly from interviews and observations, can be used to inform mobile app development. I argue that it is feasible to “scale up” such methods in order to help designers gain insight into large-scale deployments. The paper points to some technical approaches that may help in achieving this. The paper ends by arguing that scaling up field methods branches them away from ethnography. Ethnography has traditionally discussed scale in orthogonal ways to computer science. "
		},

		{"title": "Experiences in Logging Everyday App Use.", 
	 "author": "Bell M, Chalmers M, Fontaine L, Higgs M, Morrison A, Rooksby J, Rost M, Sherwood S",
	 "year" : "2013", 
	 "pdfLink" : "http://johnrooksby.org/papers/DE2013_bell_logging_apps.pdf", 
	 "proc" : "In Proceedings of DE2013.",
		 "abstract" : ""
		},


		{"title": "Big Data + Politics = Open Data: The Case of Health Care Data in England.", 
	 "author": "Keen J, Calinescu R, Paige R, Rooksby J ",
	 "year" : "2013", 
	 "pdfLink" : "http://johnrooksby.org/papers/PANDI_kean_bigData.pdf", 
	 "proc" : "Policy and Internet, 5(2): 228-243.",
		 "abstract" : ""
		},

		{"title": "Wild in the Laboratory: A Discussion of Plans and Situated Actions.", 
	 "author": "Rooksby J",
	 "year" : "2013", 
	 "pdfLink" : "http://johnrooksby.org/papers/TOCHI_rooksby_wild.pdf", 
	 "proc" : "ACM Transactions on Computer-Human Interaction (TOCHI) 20(3), 19: 1-17.",
		 "abstract" : ""
		},

		{"title": "Does Professional Work Need to Be Studied in a Natural Setting? A Secondary Analysis of a Laboratory Study of Software Developers.", 
	 "author": "Rooksby J",
	 "year" : "2013", 
	 "pdfLink" : "http://johnrooksby.org/papers/DesignersInAction_rooksby_draft.pdf", 
	 "proc" : "In: Petre M., and van der Hoek A. (eds.) Software Designers in Action: A Human-Centric Look at Design Work. Chapman and Hall/CRC, 79-91.",
		 "abstract" : "",
		 "publisherLink" : "http://www.crcpress.com/product/isbn/9781466501096"
		},

		{"title": "Diagnostic Work in Cloud Computing.", 
	 "author": "Rooksby J, Khajeh-Hosseini A",
	 "year" : "2012", 
	 "pdfLink" : "http://johnrooksby.org/papers/CSCW2012_rooksby_diagnosticCloud.pdf", 
	 "proc" : "In: Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW'12): 335-338.",
		 "abstract" : ""
		},

		{"title": "The ironies of automation… still going strong at 30?", 
	 "author": "Baxter G, Rooksby J, Wang D, Khajeh-Hosseini A",
	 "year" : "2012", 
	 "pdfLink" : "http://johnrooksby.org/papers/ECCE2012_baxter_ironies.pdf", 
	 "proc" : "In: Proceedings of the European Conference on Cognitive Ergonomics.",
		 "abstract" : ""
		},

		{"title": "Face-to-Face Collaboration in Formative Design: Working Together at a Whiteboard.", 
	 "author": "Rooksby J, Ikeya N",
	 "year" : "2012", 
	 "pdfLink" : "http://johnrooksby.org/papers/IEEEsoftware_rooksby_draft.pdf", 
	 "proc" : "IEEE Software, Jan/Feb 2012, 30-34.",
		 "abstract" : ""
		},

	    {"title": "The Management and Use of Social Network Sites in a Government Department.", 
	 "author": "Rooksby J, Sommerville I",
	 "year" : "2012", 
	 "pdfLink" : "http://johnrooksby.org/papers/JCSCW_rooksby_socialNetworkSites.pdf", 
	 "proc" : "Computer Supported Cooperative Work, 21(4-5): 397-415.",
		 "abstract" : ""
		},

	    {"title": "Text at Work. Mundane Practices of Reading in Workplaces.", 
	 "author": "Rooksby J",
	 "year" : "2011", 
	 "pdfLink" : "http://johnrooksby.org/papers/EthnomethodologyAtWork_rooksby.pdf", 
	 "proc" : "In Tolmie P, Rouncefield M (Eds.) Ethnomethodology at Work. Ashgate: 173-89.",
		 "abstract" : "",
		 "publisherLink" : "http://www.ashgate.com/isbn/9780754647713"
		},

	    {"title": "Testing in the Wild: The Social and Organisational Dimensions of Real World Practice.", 
	 "author": "Rooksby J, Rouncefield M, Sommerville I",
	 "year" : "2009", 
	 "pdfLink" : "http://johnrooksby.org/papers/JCSCW_rooksby_testing.pdf", 
	 "proc" : "Computer Supported Cooperative Work, 18(5-6): 559-580.",
		 "abstract" : ""
		},

	    {"title": "Cooperative Work in Software Testing.", 
	 "author": "Martin D, Rooksby J, Rouncefield M, Sommerville I",
	 "year" : "2008", 
	 "pdfLink" : "", 
	 "proc" : "In: Proceedings of Cooperative and Human Aspects of Software Engineering (CHASE), 13 May 2008, Leipzig, Germany: 93-96.",
		 "abstract" : ""
		},

	    {"title": "Users as Contextual Features of Software Product Development and Testing.", 
	 "author": "Martin D, Rooksby J, Rouncefield M",
	 "year" : "2007", 
	 "pdfLink" : "http://johnrooksby.org/papers/Group2007_Rooksby.pdf", 
	 "proc" : "In: Proceedings of the 2007 International ACM Conference on Supporting Group Work (GROUP), 4-7 November, Sanibel Island, Florida: 301-310.",
		 "abstract" : ""
		},

	    {"title": "“Good” Organisational Reasons for “Bad” Software Testing: An Ethnographic Study of Testing in a Small Software Company.", 
	 "author": "Martin D, Rooksby J, Rouncefield M, Sommerville I",
	 "year" : "2007", 
	 "pdfLink" : "http://johnrooksby.org/papers/ICSE2007_martin_testing.pdf", 
	 "proc" : "In: Proceedings of The 29th International Conference on Software Engineering (ICSE), 20-26 May 2007, Minneapolis MN, USA: 602-611.",
		 "abstract" : ""
		},

	    {"title": "Incident Reporting Schemes and the Need for a Good Story.", 
	 "author": "Rooksby J, Gerry R, Smith AF",
	 "year" : "2007", 
	 "pdfLink" : "http://johnrooksby.org/papers/IJMI_rooksby_goodstory.pdf", 
	 "proc" : "International Journal of Medical Informatics, 76: 205-211.",
		 "abstract" : ""
		},

	    {"title": "A Hybrid Approach to Upstream Requirements: IBIS and Cognitive Mapping.", 
	 "author": "Rooksby J, Sommerville I and Pidd M ",
	 "year" : "2006", 
	 "pdfLink" : "http://johnrooksby.org/papers/RMSE_rooksby_hybrid.pdf", 
	 "proc" : "In Dutoit A.H, McCall R, Mistrik I, Paech B (eds.) Rationale Management in Software Engineering, Berlin, Springer, 137-154.",
		 "abstract" : "",
		 "publisherLink" : "http://www.springer.com/computer/swe/book/978-3-540-30997-0"
		},

	    {"title": "Involving Users in the Design of a System for Sharing Lessons from Adverse Incidents in Anaesthesia.", 
	 "author": "Sharma S, Smith AF, Rooksby J, Gerry R",
	 "year" : "2006", 
	 "pdfLink" : "http://johnrooksby.org/papers/Anaes_sharma_incident.pdf", 
	 "proc" : "Anaesthesia, 2006; 61: 350-354.",
		 "abstract" : ""
		},

	    {"title": "Wisdom, Decision Support and Paradigms of Decision Making.", 
	 "author": "Mackenzie A, Pidd M, Rooksby J, Sommerville I, Warren I, Westcombe M",
	 "year" : "2006", 
	 "pdfLink" : "http://johnrooksby.org/papers/EJOR_mackenzie_wisdom.pdf", 
	 "proc" : "European Journal of Operational Research, 170(1): 156-171.",
		 "abstract" : ""
		}

	]
}